tutorials/cases/prescribedUsCases/convergingJamTight/constant/pyrolysisProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  v2406
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      pyrolysisProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Pyrolysis active so volPyrolysis::solveSpeciesMass() runs and transports the
// solid species by Us. With chemistry off the reaction source is zero, so the
// species equation is pure advection.
active          true;

heterogeneousPyrolysisModel  volPyrolysis;

pyrolysisCoeffs
{
    subintegrateHeatTransfer true;
    bedCollapse      false;
    criticalPorosity 0.9999;
    replenish        false;

    // Packing limit -- the largest solid volume fraction a cell may hold.
    // volPyrolysis::solidReceiverLimit() refuses any solid flux that would
    // carry a cell past porosityF = minPorosity. At 0.1 a cell may reach 90 %
    // solid before the limiter refuses, so it limits LESS than convergingJam's
    // 0.4 does: the limiter reports on 207 of the run's 250 steps against 240,
    // and withholds up to 1.05e-10 m3 against 1.77e-10 m3. This is the variant
    // nearest the cliff below.
    //
    // The key has to be set to something. The default 0 admits a cell with no
    // void left at all, and the gas continuity equation's
    // fvm::ddt(porosityF, rho) diagonal then goes to zero: the run dies with a
    // SIGFPE inside Foam::diagonalSolver rather than through any solver
    // diagnostic.
    minPorosity      0.1;
}

infoOutput      true;

// ************************************************************************* //
