tutorials/cases/prescribedUsCases/convergingJamTight/constant/reactions
species
(
    N2
);

reactions
{
}
